let quotes = {}

// https://zh.wikiquote.org/zh-cn/%E6%B1%9F%E6%B3%BD%E6%B0%91
quotes.haha = [
  'One day when we were young.',
  'Four score and seven years ago...',
  '那么但是，我想我唯一的办法，就是我的声音要比它还高。',
  '所有人，不论长幼都必须说英语。',
  '你们给我搞的这本东西啊，Excited！',
  '很惭愧，就做了一点微小的工作，谢谢大家。',
  '人呐就都不知道，自己就不可以预料。一个人的命运啊，当然要靠自我奋斗，但是也要考虑到历史的行程。',
  '这个报告经过好几百个教授一致通过。',
  '所以邓小平同志跟我讲话，说“中央都决定啦，你来当总书记”，我说另请高明吧。我实在我也不是谦虚。',
  '所以后来我就念了两首诗，叫“苟利国家生死以，岂因祸福避趋之”',
  '到了北京我干了这十几年也没有什么别的，大概三件事',
  'I think I speak very poor English, but anyway I dare to say. This is very important.',
  '我别的本事没有，但是会终身学习，去到哪儿学到哪儿，我永远不会放弃学习，虚心学习再学习！',
  '人的生命是有限的，知识是那么浩瀚，即使你怎么尽全力地努力，也只能得到一点点！',
  '你们媒体千万要注意啊，不要“见着风，是得雨”啊。接到这些消息，你媒体本身也要判断，明白意思吗？假使这些完全……无中生有的东西，你再帮他说一遍，你等于……你也等于……你也有责任吧？',
  '刚才你问我啊，我可以回答你一句“无可奉告”，那你们又不高兴，那怎么办？',
  '我觉得你们啊，你们……我感觉你们新闻界还要学习一个，你们非常熟悉西方的这一套 value。',
  '你们毕竟还 too young，明白这意思吧。',
  '我告诉你们我是身经百战了，见得多了！啊，西方的哪一个国家我没去过？',
  '你们要知道，美国的华莱士，那比你们不知道高到哪里去了。啊，我跟他谈笑风生！所以说媒体啊，要……还是要提高自己的知识水平！懂我的意思——识得唔识得啊？',
  '唉，我也给你们着急啊，真的。',
  '你们有一个好，全世界跑到什么地方，你们比其他的西方记者啊，跑得还快。但是呢，问来问去的问题啊，都 too simple，啊，sometimes naïve! 懂了没有啊？',
  '识得唔识得啊？',
  '我很抱歉，我今天是作为一个长者给你们讲的。我不是新闻工作者，但是我见得太多了，我……我有这个必要告诉你们一点，人生的经验。',
  '我刚才我很想啊，就是我每一次碰到你们我就讲中国有一句话叫“闷声大发财”，我就什么话也不说。这是最好的！但是我想，我见到你们这样热情啊，一句话不说也不好。',
  '所以你刚才你一定要——在宣传上将来如果你们报道上有偏差，你们要负责的。',
  '你问我不支……支持不支持，我是支持的。我就明确地给你告诉这一点。',
  '连任也要按照香港的法律啊，对不对？要要……要按照香港的……当然我们的决定权也是很重要的。',
  '你们啊，不要想……喜欢……弄个大新闻，说现在已经钦定了，再把我批判一番。',
  '你们啊，naïve!',
  'I\'m angry! 我跟你讲啊，你们这样子啊，是不行的！',
  '我今天算是得罪了你们一下！'
]

module.exports = quotes
